{
    "id":"1.1.0",
    "data": [
        {
            "content": "Introducción al funcionamiento de Internet",
            "type": "title"
        },
        {
            "content": "./public/assets/img/ejemplo-contenidos-1.jpg",
            "type": "img"
        },
        {
            "content": "Internet es una red mundial que para permite la conexión entre ordenadores a través de un protocolo de comunicaciones, formando <strong>una telaraña de información</strong>.",
            "type": "text"
        },
        {
            "content": "Para entender el funcionamiento de internet. hay que tener claros una serie de conceptos:",
            "type": "text"
        },
        {
            "content": "Cliente: Es el ordenador del usuario.",
            "type": "list"
        },
        {
            "content": "Servidor web o hosting: Es un ordenador que contiene multitud de archivos de información y que “esperan” peticiones de otros ordenadores (clientes), conectados a una red.",
            "type": "list"
        },
        {
            "content": "Navegador web: Es un programa instalado en el ordenador cliente que sirve para pedir e interpretar la información disponible en un servidor.",
            "type": "list"
        },
        {
            "content": "./public/assets/img/ejemplo-contenidos-2.png",
            "type": "img"
        },
        {
            "content": "Esta petición, que hace el ordenador cliente al servidor cuando se escribe una dirección URL en la barra de direcciones del navegador web, se lleva a cabo a través del protocolo http (una serie de normas que se usa para acceder a páginas web).",
            "type": "text"
        },
        {
            "content": "Todos los ordenadores conectados a internet (tanto los ordenadores clientes como los servidores) tienen un identificador único (dirección IP). Para poder acceder desde un navegador web a un servidor web, necesitamos conocer la dirección IP del servidor web. Para facilitar esta tarea, está el sistema de nombres de dominio (DNS) que se encarga de traducir las direcciones IP a un nombre identificativo o Dominio.",
            "type": "text"
        },
        {
            "content": "El servidor nos da una respuesta (a la petición solicitada) en forma de archivos HTML, que el navegador entiende e interpreta, como una página web.",
            "type": "text"
        },
        {
            "content": "hosting",
            "type": "subtitle"
        },
        {
            "content": "Para poder acceder directamente a los archivos alojados en un hosting, tenemos el protocolo FTP, que permite transferir datos entre el ordenador cliente y el hosting a través de programas o clientes FTP como Filezilla, Ciberduck o Transmit.",
            "type": "text"
        }
    ]
}